komarovn654/stm32f4xx_hal/lib/rcc/inc/hal_rcc_regs.h
#pragma once

#include "stdint.h"

typedef struct RCC_TypeDef
{
    uint32_t CR;
    uint32_t PLLCFGR;
    uint32_t CFGR;
    uint32_t CIR;
    uint32_t AHB1RSTR;
    uint32_t AHB2RSTR;
    uint32_t AHB3RSTR;
    uint32_t reserved1;
    uint32_t APB1RSTR;
    uint32_t APB2RSTR;
    uint32_t reserved2;
    uint32_t reserved3;
    uint32_t AHB1ENR;
    uint32_t AHB2ENR;
    uint32_t AHB3ENR;
    uint32_t reserved4;
    uint32_t APB1ENR;
    uint32_t APB2ENR;
    uint32_t reserved5;
    uint32_t reserved6;
    uint32_t AHB1LPENR;
    uint32_t AHB2LPENR;
    uint32_t AHB3LPENR;
    uint32_t reserved7;
    uint32_t APB1LPENR;
    uint32_t APB2LPENR;
    uint32_t reserved8;
    uint32_t reserved9;
    uint32_t BDCR;
    uint32_t reserved10;
    uint32_t reserved11;
    uint32_t SSCGR;
    uint32_t PLLI2SCFGR;
    uint32_t PLLSAICFGR;
    uint32_t DCKCFGR;
} RCC_TypeDef;

#define RCC_BASE 0x40023800

#define RCC ((RCC_TypeDef *) RCC_BASE)

/* RCC clock control register (RCC_CR) */
#define RCC_CR_DEFAULT          (0x00000083)
#define RCC_CR_DEFAULT_MSK      (0xFFFF00FF)

#define RCC_CR_HSION_POS        (0x00)
#define RCC_CR_HSION_MSK        (0x01 << RCC_CR_HSION_POS)
#define RCC_CR_HSIRDY_POS       (0x01)
#define RCC_CR_HSIRDY_MSK       (0x01 << RCC_CR_HSIRDY_POS)
#define RCC_CR_HSITRIM_POS      (0x03)
#define RCC_CR_HSITRIM_MSK      (0x1F << RCC_CR_HSITRIM_POS)
#define RCC_CR_HSICAL_POS       (0x08)
#define RCC_CR_HSICAL_MSK       (0xFF << RCC_CR_HSICAL_POS)
#define RCC_CR_HSEON_POS        (0x10)
#define RCC_CR_HSEON_MSK        (0x1 << RCC_CR_HSEON_POS)
#define RCC_CR_HSERDY_POS       (0x11)
#define RCC_CR_HSERDY_MSK       (0x01 << RCC_CR_HSERDY_POS)
#define RCC_CR_HSEBYP_POS       (0x12)
#define RCC_CR_HSEBYP_MSK       (0x01 << RCC_CR_HSEBYP_POS)
#define RCC_CR_CSSON_POS        (0x13)
#define RCC_CR_CSSON_MSK        (0x01 << RCC_CR_CSSON_POS)
#define RCC_CR_PLLON_POS        (0x18)
#define RCC_CR_PLLON_MSK        (0x01 << RCC_CR_PLLON_POS)
#define RCC_CR_PLLRDY_POS       (0x19)
#define RCC_CR_PLLRDY_MSK       (0x01 << RCC_CR_PLLRDY_POS)
#define RCC_CR_PLLI2SON_POS     (0x1A)
#define RCC_CR_PLLI2SON_MSK     (0x01 << RCC_CR_PLLI2SON_POS)
#define RCC_CR_PLLI2SRDY_POS    (0x1B)
#define RCC_CR_PLLI2SRDY_MSK    (0x01 << RCC_CR_PLLI2SRDY_POS)

#define RCC_CR_PLL_ON           (0x01)
#define RCC_CR_HSE_ON           (0x01)
#define RCC_CR_HSI_ON           (0x01)

/* RCC PLL configuration register (RCC_PLLCFGR) */
#define RCC_PLLCFGR_DEFAULT (0x24003010)

#define RCC_PLLCFGR_PLLM_POS    (0x00)
#define RCC_PLLCFGR_PLLM_MSK    (0x3F << RCC_PLLCFGR_PLLM_POS)
#define RCC_PLLCFGR_PLLN_POS    (0x06)
#define RCC_PLLCFGR_PLLN_MSK    (0x3FF << RCC_PLLCFGR_PLLN_POS)
#define RCC_PLLCFGR_PLLP_POS    (0x10)
#define RCC_PLLCFGR_PLLP_MSK    (0x03 << RCC_PLLCFGR_PLLP_POS)
#define RCC_PLLCFGR_PLLSRC_POS  (0x16)
#define RCC_PLLCFGR_PLLSRC_MSK  (0x01 << RCC_PLLCFGR_PLLSRC_POS)
#define RCC_PLLCFGR_PLLQ_POS    (0x18)
#define RCC_PLLCFGR_PLLQ_MSK    (0x0F << RCC_PLLCFGR_PLLQ_POS)

#define PLL_SOURCE_HSE (1)
#define PLL_SOURCE_HSI (0)

#define PLL_PLLCFGR_P0 (2)
#define PLL_PLLCFGR_P1 (4)
#define PLL_PLLCFGR_P2 (6)
#define PLL_PLLCFGR_P3 (8)
#define PLL_PLLCFGR_P(REG_VAL) (REG_VAL * 2 + 2)

/* RCC clock configuration register (RCC_CFGR) */
#define RCC_CFGR_DEFAULT (0x00000000U)

#define RCC_CFGR_SW_POS         (0x00)
#define RCC_CFGR_SW_MSK         (0x03 << RCC_CFGR_SW_POS)
#define RCC_CFGR_SWS_POS        (0x02)
#define RCC_CFGR_SWS_MSK        (0x03 << RCC_CFGR_SWS_POS)
#define RCC_CFGR_HPRE_POS       (0x04)
#define RCC_CFGR_HPRE_MSK       (0x0F << RCC_CFGR_HPRE_POS)
#define RCC_CFGR_PPRE1_POS      (0x0A)
#define RCC_CFGR_PPRE1_MSK      (0x07 << RCC_CFGR_PPRE1_POS)
#define RCC_CFGR_PPRE2_POS      (0x0D)
#define RCC_CFGR_PPRE2_MSK      (0x07 << RCC_CFGR_PPRE2_POS)
#define RCC_CFGR_RTCPRE_POS     (0x10)
#define RCC_CFGR_RTCPRE_MSK     (0x1F << RCC_CFGR_RTCPRE_POS)
#define RCC_CFGR_MCO1_POS       (0x15)
#define RCC_CFGR_MCO1_MSK       (0x03 << RCC_CFGR_MCO1_POS)
#define RCC_CFGR_I2SSRC_POS     (0x17)
#define RCC_CFGR_I2SSRC_MSK     (0x01 << RCC_CFGR_I2SSRC_POS)
#define RCC_CFGR_MCO1PRE_POS    (0x18)
#define RCC_CFGR_MCO1PRE_MSK    (0x07 << RCC_CFGR_MCO1PRE_POS)
#define RCC_CFGR_MCO2PRE_POS    (0x1B)
#define RCC_CFGR_MCO2PRE_MSK    (0x07 << RCC_CFGR_MCO2PRE_POS)
#define RCC_CFGR_MCO2_POS       (0x1E)
#define RCC_CFGR_MCO2_MSK       (0x03 << RCC_CFGR_MCO2_POS)

#define RCC_SW_SRC_HSI          (0x00)
#define RCC_SW_SRC_HSE          (0x01)
#define RCC_SW_SRC_PLL          (0x02)

#define RCC_SWS_ACT_HSI         (0x00)
#define RCC_SWS_ACT_HSE         (0x01)
#define RCC_SWS_ACT_PLL         (0x02)

#define RCC_MCO1_SRC_HSI        (0x00)
#define RCC_MCO1_SRC_LSE        (0x01)
#define RCC_MCO1_SRC_HSE        (0x02)
#define RCC_MCO1_SRC_PLL        (0x03)

#define RCC_MCO1_DIV2           (0x04)
#define RCC_MCO1_DIV3           (0x05)
#define RCC_MCO1_DIV4           (0x06)
#define RCC_MCO1_DIV5           (0x07)

#define RCC_MCO2_SRC_SYSCLK     (0x00)
#define RCC_MCO2_SRC_PLLI2S     (0x01)
#define RCC_MCO2_SRC_HSE        (0x02)
#define RCC_MCO2_SRC_PLL        (0x03)

#define RCC_MCO2_DIV2           (0x04)
#define RCC_MCO2_DIV3           (0x05)
#define RCC_MCO2_DIV4           (0x06)
#define RCC_MCO2_DIV5           (0x07)

/* RCC clock interrupt register (RCC_CIR) */
#define RCC_CIR_DEFAULT (0x00000000U)

#define RCC_CIR_LSIRDYF_POS     (0x00)
#define RCC_CIR_LSIRDYF_MSK     (0x01 << RCC_CIR_LSIRDYF_POS)
#define RCC_CIR_LSERDYF_POS     (0x01)
#define RCC_CIR_LSERDYF_MSK     (0x01 << RCC_CIR_LSERDYF_POS)
#define RCC_CIR_HSIRDYF_POS     (0x02)
#define RCC_CIR_HSIRDYF_MSK     (0x01 << RCC_CIR_HSIRDYF_POS)
#define RCC_CIR_HSERDYF_POS     (0x03)
#define RCC_CIR_HSERDYF_MSK     (0x01 << RCC_CIR_HSERDYF_POS)
#define RCC_CIR_PLLRDYF_POS     (0x04)
#define RCC_CIR_PLLRDYF_MSK     (0x01 << RCC_CIR_PLLRDYF_POS)
#define RCC_CIR_PLLI2SRDYF_POS  (0x05)
#define RCC_CIR_PLLI2SRDYF_MSK  (0x01 << RCC_CIR_PLLI2SRDYF_POS)
#define RCC_CIR_PLLSAIRDYF_POS  (0x06)
#define RCC_CIR_PLLSAIRDYF_MSK  (0x01 << RCC_CIR_PLLSAIRDYF_POS)
#define RCC_CIR_CSSF_POS        (0x07)
#define RCC_CIR_CSSF_MSK        (0x01 << RCC_CIR_CSSF_POS)
#define RCC_CIR_LSIRDYIE_POS    (0x08)
#define RCC_CIR_LSIRDYIE_MSK    (0x01 << RCC_CIR_LSIRDYIE_POS)
#define RCC_CIR_LSERDYIE_POS    (0x09)
#define RCC_CIR_LSERDYIE_MSK    (0x01 << RCC_CIR_LSERDYIE_POS)
#define RCC_CIR_HSIRDYIE_POS    (0x0A)
#define RCC_CIR_HSIRDYIE_MSK    (0x01 << RCC_CIR_HSIRDYIE_POS)
#define RCC_CIR_HSERDYIE_POS    (0x0B)
#define RCC_CIR_HSERDYIE_MSK    (0x01 << RCC_CIR_HSERDYIE_POS)
#define RCC_CIR_PLLRDYIE_POS    (0x0C)
#define RCC_CIR_PLLRDYIE_MSK    (0x01 << RCC_CIR_PLLRDYIE_POS)
#define RCC_CIR_PLLI2SRDYIE_POS (0x0D)
#define RCC_CIR_PLLI2SRDYIE_MSK (0x01 << RCC_CIR_PLLI2SRDYIE_POS)
#define RCC_CIR_PLLSAIRDYIE_POS (0x0E)
#define RCC_CIR_PLLSAIRDYIE_MSK (0x01 << RCC_CIR_PLLSAIRDYIE_POS)
#define RCC_CIR_LSIRDYC_POS     (0x10)
#define RCC_CIR_LSIRDYC_MSK     (0x01 << RCC_CIR_LSIRDYC_POS)
#define RCC_CIR_LSERDYC_POS     (0x11)
#define RCC_CIR_LSERDYC_MSK     (0x01 << RCC_CIR_LSERDYC_POS)
#define RCC_CIR_HSIRDYC_POS     (0x12)
#define RCC_CIR_HSIRDYC_MSK     (0x01 << RCC_CIR_HSIRDYC_POS)
#define RCC_CIR_HSERDYC_POS     (0x13)
#define RCC_CIR_HSERDYC_MSK     (0x01 << RCC_CIR_HSERDYC_POS)
#define RCC_CIR_PLLRDYC_POS     (0x14)
#define RCC_CIR_PLLRDYC_MSK     (0x01 << RCC_CIR_PLLRDYC_POS)
#define RCC_CIR_PLLI2SRDYC_POS  (0x15)
#define RCC_CIR_PLLI2SRDYC_MSK  (0x01 << RCC_CIR_PLLI2SRDYC_POS)    
#define RCC_CIR_PLLSAIRDYC_POS  (0x16)
#define RCC_CIR_PLLSAIRDYC_MSK  (0x01 << RCC_CIR_PLLSAIRDYC_POS)
#define RCC_CIR_CSSC_POS        (0x17)
#define RCC_CIR_CSSC_MSK        (0x01 << RCC_CIR_CSSC_POS)

/* RCC AHB1 peripheral reset register (RCC_AHB1RSTR) */
#define RCC_AHB1RSTR_DEFAULT (0x00000000U)

#define RCC_AHB1RSTR_GPIOARST_POS   (0x00)
#define RCC_AHB1RSTR_GPIOARST_MSK   (0x01 << RCC_AHB1RSTR_GPIOARST_POS)
#define RCC_AHB1RSTR_GPIOBRST_POS   (0x01)
#define RCC_AHB1RSTR_GPIOBRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOBRST_POS)
#define RCC_AHB1RSTR_GPIOCRST_POS   (0x02)
#define RCC_AHB1RSTR_GPIOCRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOCRST_POS)
#define RCC_AHB1RSTR_GPIODRST_POS   (0x03)
#define RCC_AHB1RSTR_GPIODRST_MSK   (0x01 << RCC_AHB1RSTR_GPIODRST_POS)
#define RCC_AHB1RSTR_GPIOERST_POS   (0x04)
#define RCC_AHB1RSTR_GPIOERST_MSK   (0x01 << RCC_AHB1RSTR_GPIOERST_POS)
#define RCC_AHB1RSTR_GPIOFRST_POS   (0x05)
#define RCC_AHB1RSTR_GPIOFRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOFRST_POS)
#define RCC_AHB1RSTR_GPIOGRST_POS   (0x06)
#define RCC_AHB1RSTR_GPIOGRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOGRST_POS)
#define RCC_AHB1RSTR_GPIOHRST_POS   (0x07)
#define RCC_AHB1RSTR_GPIOHRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOHRST_POS)
#define RCC_AHB1RSTR_GPIOIRST_POS   (0x08)
#define RCC_AHB1RSTR_GPIOIRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOIRST_POS)
#define RCC_AHB1RSTR_GPIOJRST_POS   (0x09)
#define RCC_AHB1RSTR_GPIOJRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOJRST_POS)
#define RCC_AHB1RSTR_GPIOKRST_POS   (0x0A)
#define RCC_AHB1RSTR_GPIOKRST_MSK   (0x01 << RCC_AHB1RSTR_GPIOKRST_POS)
#define RCC_AHB1RSTR_CRCRST_POS     (0x0C)
#define RCC_AHB1RSTR_CRCRST_MSK     (0x01 << RCC_AHB1RSTR_CRCRST_POS)
#define RCC_AHB1RSTR_DMA1RST_POS    (0x15)
#define RCC_AHB1RSTR_DMA1RST_MSK    (0x01 << RCC_AHB1RSTR_DMA1RST_POS)
#define RCC_AHB1RSTR_DMA2RST_POS    (0x16)
#define RCC_AHB1RSTR_DMA2RST_MSK    (0x01 << RCC_AHB1RSTR_DMA2RST_POS)
#define RCC_AHB1RSTR_DMA2DRST_POS   (0x17)
#define RCC_AHB1RSTR_DMA2DRST_MSK   (0x01 << RCC_AHB1RSTR_DMA2DRST_POS)
#define RCC_AHB1RSTR_ETHMACRST_POS  (0x19)
#define RCC_AHB1RSTR_ETHMACRST_MSK  (0x01 << RCC_AHB1RSTR_ETHMACRST_POS)
#define RCC_AHB1RSTR_OTGHSRST_POS   (0x1D)
#define RCC_AHB1RSTR_OTGHSRST_MSK   (0x01 << RCC_AHB1RSTR_OTGHSRST_POS)

/* RCC AHB1 peripheral reset register (RCC_AHB2RSTR) */
#define RCC_AHB2RSTR_DEFAULT (0x00000000U)

#define RCC_AHB2RSTR_DCMIRST_POS    (0x00)
#define RCC_AHB2RSTR_DCMIRST_MSK    (0x01 << RCC_AHB2RSTR_DCMIRST_POS)
#define RCC_AHB2RSTR_CRYPRST_POS    (0x04)
#define RCC_AHB2RSTR_CRYPRST_MSK    (0x01 << RCC_AHB2RSTR_CRYPRST_POS)
#define RCC_AHB2RSTR_HASHRST_POS    (0x05)
#define RCC_AHB2RSTR_HASHRST_MSK    (0x01 << RCC_AHB2RSTR_HASHRST_POS)
#define RCC_AHB2RSTR_RNGRST_POS     (0x06)
#define RCC_AHB2RSTR_RNGRST_MSK     (0x01 << RCC_AHB2RSTR_RNGRST_POS)
#define RCC_AHB2RSTR_OTGFSRST_POS   (0x07)
#define RCC_AHB2RSTR_OTGFSRST_MSK   (0x01 << RCC_AHB2RSTR_OTGFSRST_POS)

