komarovn654/stm32f4xx_hal/lib/rcc/inc/hal_rcc_regs.h
/* RCC AHB3 peripheral reset register (RCC_AHB3RSTR) */
#define RCC_AHB3RSTR_DEFAULT (0x00000000U)

#define RCC_AHB3RSTR_FMCRST_POS (0x00)
#define RCC_AHB3RSTR_FMCRST_MSK (0x01 << RCC_AHB3RSTR_FMCRST_POS)

/* RCC APB1 peripheral reset register (RCC_APB1RSTR) */
#define RCC_APB1RSTR_DEFAULT (0x00000000U)

#define RCC_APB1RSTR_TIM2RST_POS    (0x00)
#define RCC_APB1RSTR_TIM2RST_MSK    (0x01 << RCC_APB1RSTR_TIM2RST_POS)
#define RCC_APB1RSTR_TIM3RST_POS    (0x01)
#define RCC_APB1RSTR_TIM3RST_MSK    (0x01 << RCC_APB1RSTR_TIM3RST_POS)
#define RCC_APB1RSTR_TIM4RST_POS    (0x02)
#define RCC_APB1RSTR_TIM4RST_MSK    (0x01 << RCC_APB1RSTR_TIM4RST_POS)
#define RCC_APB1RSTR_TIM5RST_POS    (0x03)
#define RCC_APB1RSTR_TIM5RST_MSK    (0x01 << RCC_APB1RSTR_TIM5RST_POS)
#define RCC_APB1RSTR_TIM6RST_POS    (0x04)
#define RCC_APB1RSTR_TIM6RST_MSK    (0x01 << RCC_APB1RSTR_TIM6RST_POS)
#define RCC_APB1RSTR_TIM7RST_POS    (0x05)
#define RCC_APB1RSTR_TIM7RST_MSK    (0x01 << RCC_APB1RSTR_TIM7RST_POS)
#define RCC_APB1RSTR_TIM12RST_POS   (0x06)
#define RCC_APB1RSTR_TIM12RST_MSK   (0x01 << RCC_APB1RSTR_TIM12RST_POS)
#define RCC_APB1RSTR_TIM13RST_POS   (0x07)
#define RCC_APB1RSTR_TIM13RST_MSK   (0x01 << RCC_APB1RSTR_TIM13RST_POS)
#define RCC_APB1RSTR_TIM14RST_POS   (0x08)
#define RCC_APB1RSTR_TIM14RST_MSK   (0x01 << RCC_APB1RSTR_TIM14RST_POS)
#define RCC_APB1RSTR_WWDGRST_POS    (0x0B)
#define RCC_APB1RSTR_WWDGRST_MSK    (0x01 << RCC_APB1RSTR_WWDGRST_POS)
#define RCC_APB1RSTR_SPI2RST_POS    (0x0E)
#define RCC_APB1RSTR_SPI2RST_MSK    (0x01 << RCC_APB1RSTR_SPI2RST_POS)
#define RCC_APB1RSTR_SPI3RST_POS    (0x0F)
#define RCC_APB1RSTR_SPI3RST_MSK    (0x01 << RCC_APB1RSTR_SPI3RST_POS)
#define RCC_APB1RSTR_USART2RST_POS  (0x11)
#define RCC_APB1RSTR_USART2RST_MSK  (0x01 << RCC_APB1RSTR_USART2RST_POS)
#define RCC_APB1RSTR_USART3RST_POS  (0x12)
#define RCC_APB1RSTR_USART3RST_MSK  (0x01 << RCC_APB1RSTR_USART3RST_POS)
#define RCC_APB1RSTR_UART4RST_POS   (0x13)
#define RCC_APB1RSTR_UART4RST_MSK   (0x01 << RCC_APB1RSTR_UART4RST_POS)
#define RCC_APB1RSTR_UART5RST_POS   (0x14)
#define RCC_APB1RSTR_UART5RST_MSK   (0x01 << RCC_APB1RSTR_UART5RST_POS)
#define RCC_APB1RSTR_I2C1RST_POS    (0x15)
#define RCC_APB1RSTR_I2C1RST_MSK    (0x01 << RCC_APB1RSTR_I2C1RST_POS)
#define RCC_APB1RSTR_I2C2RST_POS    (0x16)
#define RCC_APB1RSTR_I2C2RST_MSK    (0x01 << RCC_APB1RSTR_I2C2RST_POS)
#define RCC_APB1RSTR_I2C3RST_POS    (0x17)
#define RCC_APB1RSTR_I2C3RST_MSK    (0x01 << RCC_APB1RSTR_I2C3RST_POS)
#define RCC_APB1RSTR_CAN1RST_POS    (0x19)
#define RCC_APB1RSTR_CAN1RST_MSK    (0x01 << RCC_APB1RSTR_CAN1RST_POS)
#define RCC_APB1RSTR_CAN2RST_POS    (0x1A)
#define RCC_APB1RSTR_CAN2RST_MSK    (0x01 << RCC_APB1RSTR_CAN2RST_POS)
#define RCC_APB1RSTR_PWRRST_POS     (0x1C)
#define RCC_APB1RSTR_PWRRST_MSK     (0x01 << RCC_APB1RSTR_PWRRST_POS)
#define RCC_APB1RSTR_DACRST_POS     (0x1D)
#define RCC_APB1RSTR_DACRST_MSK     (0x01 << RCC_APB1RSTR_DACRST_POS)
#define RCC_APB1RSTR_UART7RST_POS   (0x1E)
#define RCC_APB1RSTR_UART7RST_MSK   (0x01 << RCC_APB1RSTR_UART7RST_POS)
#define RCC_APB1RSTR_UART8RST_POS   (0x1F)
#define RCC_APB1RSTR_UART8RST_MSK   (0x01 << RCC_APB1RSTR_UART8RST_POS)

/* RCC APB2 peripheral reset register (RCC_APB2RSTR) */
#define RCC_APB2RSTR_DEFAULT (0x00000000U)

#define RCC_APB2RSTR_TIM1RST_POS    (0x00)
#define RCC_APB2RSTR_TIM1RST_MSK    (0x01 << RCC_APB2RSTR_TIM1RST_POS)
#define RCC_APB2RSTR_TIM8RST_POS    (0x01)
#define RCC_APB2RSTR_TIM8RST_MSK    (0x01 << RCC_APB2RSTR_TIM8RST_POS)
#define RCC_APB2RSTR_USART1RST_POS  (0x04)
#define RCC_APB2RSTR_USART1RST_MSK  (0x01 << RCC_APB2RSTR_USART1RST_POS)
#define RCC_APB2RSTR_USART6RST_POS  (0x05)
#define RCC_APB2RSTR_USART6RST_MSK  (0x01 << RCC_APB2RSTR_USART6RST_POS)
#define RCC_APB2RSTR_ADCRST_POS     (0x08)
#define RCC_APB2RSTR_ADCRST_MSK     (0x01 << RCC_APB2RSTR_ADCRST_POS)
#define RCC_APB2RSTR_SDIORST_POS    (0x0B)
#define RCC_APB2RSTR_SDIORST_MSK    (0x01 << RCC_APB2RSTR_SDIORST_POS)
#define RCC_APB2RSTR_SPI1RST_POS    (0x0C)
#define RCC_APB2RSTR_SPI1RST_MSK    (0x01 << RCC_APB2RSTR_SPI1RST_POS)
#define RCC_APB2RSTR_SPI4RST_POS    (0x0D)
#define RCC_APB2RSTR_SPI4RST_MSK    (0x01 << RCC_APB2RSTR_SPI4RST_POS)
#define RCC_APB2RSTR_SYSCFGRST_POS  (0x0E)
#define RCC_APB2RSTR_SYSCFGRST_MSK  (0x01 << RCC_APB2RSTR_SYSCFGRST_POS)
#define RCC_APB2RSTR_TIM9RST_POS    (0x10)
#define RCC_APB2RSTR_TIM9RST_MSK    (0x01 << RCC_APB2RSTR_TIM9RST_POS)
#define RCC_APB2RSTR_TIM10RST_POS   (0x11)
#define RCC_APB2RSTR_TIM10RST_MSK   (0x01 << RCC_APB2RSTR_TIM10RST_POS)
#define RCC_APB2RSTR_TIM11RST_POS   (0x12)
#define RCC_APB2RSTR_TIM11RST_MSK   (0x01 << RCC_APB2RSTR_TIM11RST_POS)
#define RCC_APB2RSTR_SPI5RST_POS    (0x14)
#define RCC_APB2RSTR_SPI5RST_MSK    (0x01 << RCC_APB2RSTR_SPI5RST_POS)
#define RCC_APB2RSTR_SPI6RST_POS    (0x15)
#define RCC_APB2RSTR_SPI6RST_MSK    (0x01 << RCC_APB2RSTR_SPI6RST_POS)
#define RCC_APB2RSTR_SAI1RST_POS    (0x16)
#define RCC_APB2RSTR_SAI1RST_MSK    (0x01 << RCC_APB2RSTR_SAI1RST_POS)
#define RCC_APB2RSTR_LTDCRST_POS    (0x1A)
#define RCC_APB2RSTR_LTDCRST_MSK    (0x01 << RCC_APB2RSTR_LTDCRST_POS)

/* RCC AHB1 peripheral clock register (RCC_AHB1ENR) */
#define RCC_AHB1ENR_DEFAULT (0x00100000U)

#define RCC_AHB1ENR_GPIOAEN_POS         (0x00)
#define RCC_AHB1ENR_GPIOAEN_MSK         (0x01 << RCC_AHB1ENR_GPIOAEN_POS)
#define RCC_AHB1ENR_GPIOBEN_POS         (0x01)
#define RCC_AHB1ENR_GPIOBEN_MSK         (0x01 << RCC_AHB1ENR_GPIOBEN_POS)
#define RCC_AHB1ENR_GPIOCEN_POS         (0x02)
#define RCC_AHB1ENR_GPIOCEN_MSK         (0x01 << RCC_AHB1ENR_GPIOCEN_POS)
#define RCC_AHB1ENR_GPIODEN_POS         (0x03)
#define RCC_AHB1ENR_GPIODEN_MSK         (0x01 << RCC_AHB1ENR_GPIODEN_POS)
#define RCC_AHB1ENR_GPIOEEN_POS         (0x04)
#define RCC_AHB1ENR_GPIOEEN_MSK         (0x01 << RCC_AHB1ENR_GPIOEEN_POS)
#define RCC_AHB1ENR_GPIOFEN_POS         (0x05)
#define RCC_AHB1ENR_GPIOFEN_MSK         (0x01 << RCC_AHB1ENR_GPIOFEN_POS)
#define RCC_AHB1ENR_GPIOGEN_POS         (0x06)
#define RCC_AHB1ENR_GPIOGEN_MSK         (0x01 << RCC_AHB1ENR_GPIOGEN_POS)
#define RCC_AHB1ENR_GPIOHEN_POS         (0x07)
#define RCC_AHB1ENR_GPIOHEN_MSK         (0x01 << RCC_AHB1ENR_GPIOHEN_POS)
#define RCC_AHB1ENR_GPIOIEN_POS         (0x08)
#define RCC_AHB1ENR_GPIOIEN_MSK         (0x01 << RCC_AHB1ENR_GPIOIEN_POS)
#define RCC_AHB1ENR_GPIOJEN_POS         (0x09)
#define RCC_AHB1ENR_GPIOJEN_MSK         (0x01 << RCC_AHB1ENR_GPIOJEN_POS)
#define RCC_AHB1ENR_GPIOKEN_POS         (0x0A)
#define RCC_AHB1ENR_GPIOKEN_MSK         (0x01 << RCC_AHB1ENR_GPIOKEN_POS)
#define RCC_AHB1ENR_CRCEN_POS           (0x0C)
#define RCC_AHB1ENR_CRCEN_MSK           (0x01 << RCC_AHB1ENR_CRCEN_POS)
#define RCC_AHB1ENR_BKPSRAMEN_POS       (0x12)
#define RCC_AHB1ENR_BKPSRAMEN_MSK       (0x01 << RCC_AHB1ENR_BKPSRAMEN_POS)
#define RCC_AHB1ENR_CCMDATARAMEN_POS    (0x14)
#define RCC_AHB1ENR_CCMDATARAMEN_MSK    (0x01 << RCC_AHB1ENR_CCMDATARAMEN_POS)
#define RCC_AHB1ENR_DMA1EN_POS          (0x15)
#define RCC_AHB1ENR_DMA1EN_MSK          (0x01 << RCC_AHB1ENR_DMA1EN_POS)
#define RCC_AHB1ENR_DMA2EN_POS          (0x16)
#define RCC_AHB1ENR_DMA2EN_MSK          (0x01 << RCC_AHB1ENR_DMA2EN_POS)
#define RCC_AHB1ENR_DMA2DEN_POS         (0x17)
#define RCC_AHB1ENR_DMA2DEN_MSK         (0x01 << RCC_AHB1ENR_DMA2DEN_POS)
#define RCC_AHB1ENR_ETHMACEN_POS        (0x19)
#define RCC_AHB1ENR_ETHMACEN_MSK        (0x01 << RCC_AHB1ENR_ETHMACEN_POS)
#define RCC_AHB1ENR_ETHMACTXEN_POS      (0x1A)
#define RCC_AHB1ENR_ETHMACTXEN_MSK      (0x01 << RCC_AHB1ENR_ETHMACTXEN_POS)
#define RCC_AHB1ENR_ETHMACRXEN_POS      (0x1B)
#define RCC_AHB1ENR_ETHMACRXEN_MSK      (0x01 << RCC_AHB1ENR_ETHMACRXEN_POS)
#define RCC_AHB1ENR_ETHMACPTPEN_POS     (0x1C)
#define RCC_AHB1ENR_ETHMACPTPEN_MSK     (0x01 << RCC_AHB1ENR_ETHMACPTPEN_POS)
#define RCC_AHB1ENR_OTGHSEN_POS         (0x1D)
#define RCC_AHB1ENR_OTGHSEN_MSK         (0x01 << RCC_AHB1ENR_OTGHSEN_POS)
#define RCC_AHB1ENR_OTGHSULPIEN_POS     (0x1E)
#define RCC_AHB1ENR_OTGHSULPIEN_MSK     (0x01 << RCC_AHB1ENR_OTGHSULPIEN_POS)

