komarovn654/stm32f4xx_hal/lib/rcc/inc/hal_rcc_regs.h
/* RCC AHB2 peripheral clock enable register (RCC_AHB2ENR) */
#define RCC_AHB2ENR_DEFAULT (0x00000000U)

#define RCC_AHB2ENR_DCMIEN_POS  (0x00)
#define RCC_AHB2ENR_DCMIEN_MSK  (0x01 << RCC_AHB2ENR_DCMIEN_POS)
#define RCC_AHB2ENR_CRYPEN_POS  (0x04)
#define RCC_AHB2ENR_CRYPEN_MSK  (0x01 << RCC_AHB2ENR_CRYPEN_POS)
#define RCC_AHB2ENR_HASHEN_POS  (0x05)
#define RCC_AHB2ENR_HASHEN_MSK  (0x01 << RCC_AHB2ENR_HASHEN_POS)
#define RCC_AHB2ENR_RNGEN_POS   (0x06)
#define RCC_AHB2ENR_RNGEN_MSK   (0x01 << RCC_AHB2ENR_RNGEN_POS)
#define RCC_AHB2ENR_OTGFSEN_POS (0x07)
#define RCC_AHB2ENR_OTGFSEN_MSK (0x01 << RCC_AHB2ENR_OTGFSEN_POS)

/* RCC AHB3 peripheral clock enable register (RCC_AHB3ENR) */
#define RCC_AHB3ENR_DEFAULT (0x00000000U)

#define RCC_AHB3ENR_FMCEN_POS  (0x00)
#define RCC_AHB3ENR_FMCEN_MSK  (0x01 << RCC_AHB3ENR_FMCEN_POS)

/* RCC APB1 peripheral clock enable register (RCC_APB1ENR) */
#define RCC_APB1ENR_DEFAULT (0x00000000U)

#define RCC_APB1ENR_TIM2EN_POS      (0x00)
#define RCC_APB1ENR_TIM2EN_MSK      (0x01 << RCC_APB1ENR_TIM2EN_POS)
#define RCC_APB1ENR_TIM3EN_POS      (0x01)
#define RCC_APB1ENR_TIM3EN_MSK      (0x01 << RCC_APB1ENR_TIM3EN_POS)
#define RCC_APB1ENR_TIM4EN_POS      (0x02)
#define RCC_APB1ENR_TIM4EN_MSK      (0x01 << RCC_APB1ENR_TIM4EN_POS)
#define RCC_APB1ENR_TIM5EN_POS      (0x03)
#define RCC_APB1ENR_TIM5EN_MSK      (0x01 << RCC_APB1ENR_TIM5EN_POS)
#define RCC_APB1ENR_TIM6EN_POS      (0x04)
#define RCC_APB1ENR_TIM6EN_MSK      (0x01 << RCC_APB1ENR_TIM6EN_POS)
#define RCC_APB1ENR_TIM7EN_POS      (0x05)
#define RCC_APB1ENR_TIM7EN_MSK      (0x01 << RCC_APB1ENR_TIM7EN_POS)
#define RCC_APB1ENR_TIM12EN_POS     (0x06)
#define RCC_APB1ENR_TIM12EN_MSK     (0x01 << RCC_APB1ENR_TIM12EN_POS)
#define RCC_APB1ENR_TIM13EN_POS     (0x07)
#define RCC_APB1ENR_TIM13EN_MSK     (0x01 << RCC_APB1ENR_TIM13EN_POS)
#define RCC_APB1ENR_TIM14EN_POS     (0x08)
#define RCC_APB1ENR_TIM14EN_MSK     (0x01 << RCC_APB1ENR_TIM14EN_POS)
#define RCC_APB1ENR_WWDGEN_POS      (0x0B)
#define RCC_APB1ENR_WWDGEN_MSK      (0x01 << RCC_APB1ENR_WWDGEN_POS)
#define RCC_APB1ENR_SPI2EN_POS      (0x0E)
#define RCC_APB1ENR_SPI2EN_MSK      (0x01 << RCC_APB1ENR_SPI2EN_POS)
#define RCC_APB1ENR_SPI3EN_POS      (0x0F)
#define RCC_APB1ENR_SPI3EN_MSK      (0x01 << RCC_APB1ENR_SPI3EN_POS)
#define RCC_APB1ENR_USART2EN_POS    (0x11)
#define RCC_APB1ENR_USART2EN_MSK    (0x01 << RCC_APB1ENR_USART2EN_POS)
#define RCC_APB1ENR_USART3EN_POS    (0x12)
#define RCC_APB1ENR_USART3EN_MSK    (0x01 << RCC_APB1ENR_USART3EN_POS)
#define RCC_APB1ENR_UART4EN_POS     (0x13)
#define RCC_APB1ENR_UART4EN_MSK     (0x01 << RCC_APB1ENR_UART4EN_POS)
#define RCC_APB1ENR_UART5EN_POS     (0x14)
#define RCC_APB1ENR_UART5EN_MSK     (0x01 << RCC_APB1ENR_UART5EN_POS)
#define RCC_APB1ENR_I2C1EN_POS      (0x15)
#define RCC_APB1ENR_I2C1EN_MSK      (0x01 << RCC_APB1ENR_I2C1EN_POS)
#define RCC_APB1ENR_I2C2EN_POS      (0x16)
#define RCC_APB1ENR_I2C2EN_MSK      (0x01 << RCC_APB1ENR_I2C2EN_POS)
#define RCC_APB1ENR_I2C3EN_POS      (0x17)
#define RCC_APB1ENR_I2C3EN_MSK      (0x01 << RCC_APB1ENR_I2C3EN_POS)
#define RCC_APB1ENR_CAN1EN_POS      (0x19)
#define RCC_APB1ENR_CAN1EN_MSK      (0x01 << RCC_APB1ENR_CAN1EN_POS)
#define RCC_APB1ENR_CAN2EN_POS      (0x1A)
#define RCC_APB1ENR_CAN2EN_MSK      (0x01 << RCC_APB1ENR_CAN2EN_POS)
#define RCC_APB1ENR_PWREN_POS       (0x1C)
#define RCC_APB1ENR_PWREN_MSK       (0x01 << RCC_APB1ENR_PWREN_POS)
#define RCC_APB1ENR_DACEN_POS       (0x1D)
#define RCC_APB1ENR_DACEN_MSK       (0x01 << RCC_APB1ENR_DACEN_POS)
#define RCC_APB1ENR_UART7EN_POS     (0x1E)
#define RCC_APB1ENR_UART7EN_MSK     (0x01 << RCC_APB1ENR_UART7EN_POS)
#define RCC_APB1ENR_UART8EN_POS     (0x1F)
#define RCC_APB1ENR_UART8EN_MSK     (0x01 << RCC_APB1ENR_UART8EN_POS)

/* RCC APB2 peripheral clock enable register (RCC_APB2ENR) */
#define RCC_APB2ENR_DEFAULT (0x00000000U)

#define RCC_APB2ENR_TIM1EN_POS      (0x00)
#define RCC_APB2ENR_TIM1EN_MSK      (0x01 << RCC_APB2ENR_TIM1EN_POS)
#define RCC_APB2ENR_TIM8EN_POS      (0x01)
#define RCC_APB2ENR_TIM8EN_MSK      (0x01 << RCC_APB2ENR_TIM8EN_POS)
#define RCC_APB2ENR_USART1EN_POS    (0x04)
#define RCC_APB2ENR_USART1EN_MSK    (0x01 << RCC_APB2ENR_USART1EN_POS)
#define RCC_APB2ENR_USART6EN_POS    (0x05)
#define RCC_APB2ENR_USART6EN_MSK    (0x01 << RCC_APB2ENR_USART6EN_POS)
#define RCC_APB2ENR_ADC1EN_POS      (0x08)
#define RCC_APB2ENR_ADC1EN_MSK      (0x01 << RCC_APB2ENR_ADC1EN_POS)
#define RCC_APB2ENR_ADC2EN_POS      (0x09)
#define RCC_APB2ENR_ADC2EN_MSK      (0x01 << RCC_APB2ENR_ADC2EN_POS)
#define RCC_APB2ENR_ADC3EN_POS      (0x0A)
#define RCC_APB2ENR_ADC3EN_MSK      (0x01 << RCC_APB2ENR_ADC3EN_POS)
#define RCC_APB2ENR_SDIOEN_POS      (0x0B)
#define RCC_APB2ENR_SDIOEN_MSK      (0x01 << RCC_APB2ENR_SDIOEN_POS)
#define RCC_APB2ENR_SPI1EN_POS      (0x0C)
#define RCC_APB2ENR_SPI1EN_MSK      (0x01 << RCC_APB2ENR_SPI1EN_POS)
#define RCC_APB2ENR_SPI4EN_POS      (0x0D)
#define RCC_APB2ENR_SPI4EN_MSK      (0x01 << RCC_APB2ENR_SPI4EN_POS)
#define RCC_APB2ENR_SYSCFGEN_POS    (0x0E)
#define RCC_APB2ENR_SYSCFGEN_MSK    (0x01 << RCC_APB2ENR_SYSCFGEN_POS)
#define RCC_APB2ENR_TIM9EN_POS      (0x10)
#define RCC_APB2ENR_TIM9EN_MSK      (0x01 << RCC_APB2ENR_TIM9EN_POS)
#define RCC_APB2ENR_TIM10EN_POS     (0x11)
#define RCC_APB2ENR_TIM10EN_MSK     (0x01 << RCC_APB2ENR_TIM10EN_POS)
#define RCC_APB2ENR_TIM11EN_POS     (0x12)
#define RCC_APB2ENR_TIM11EN_MSK     (0x01 << RCC_APB2ENR_TIM11EN_POS)
#define RCC_APB2ENR_SPI5EN_POS      (0x14)
#define RCC_APB2ENR_SPI5EN_MSK      (0x01 << RCC_APB2ENR_SPI5EN_POS)
#define RCC_APB2ENR_SPI6EN_POS      (0x15)
#define RCC_APB2ENR_SPI6EN_MSK      (0x01 << RCC_APB2ENR_SPI6EN_POS)
#define RCC_APB2ENR_SAI1EN_POS      (0x16)
#define RCC_APB2ENR_SAI1EN_MSK      (0x01 << RCC_APB2ENR_SAI1EN_POS)
#define RCC_APB2ENR_LTDCEN_POS      (0x1A)
#define RCC_APB2ENR_LTDCEN_MSK      (0x01 << RCC_APB2ENR_LTDCEN_POS)

/* RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR) */
#define RCC_AHB1LPENR_DEFAULT (0x7E6791FFU)

#define RCC_AHB1LPENR_GPIOALPEN_POS     (0x00)
#define RCC_AHB1LPENR_GPIOALPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOALPEN_POS)
#define RCC_AHB1LPENR_GPIOBLPEN_POS     (0x01)
#define RCC_AHB1LPENR_GPIOBLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOBLPEN_POS)
#define RCC_AHB1LPENR_GPIOCLPEN_POS     (0x02)
#define RCC_AHB1LPENR_GPIOCLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOCLPEN_POS)
#define RCC_AHB1LPENR_GPIODLPEN_POS     (0x03)
#define RCC_AHB1LPENR_GPIODLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIODLPEN_POS)
#define RCC_AHB1LPENR_GPIOELPEN_POS     (0x04)
#define RCC_AHB1LPENR_GPIOELPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOELPEN_POS)
#define RCC_AHB1LPENR_GPIOFLPEN_POS     (0x05)
#define RCC_AHB1LPENR_GPIOFLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOFLPEN_POS)
#define RCC_AHB1LPENR_GPIOGLPEN_POS     (0x06)
#define RCC_AHB1LPENR_GPIOGLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOGLPEN_POS)
#define RCC_AHB1LPENR_GPIOHLPEN_POS     (0x07)
#define RCC_AHB1LPENR_GPIOHLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOHLPEN_POS)
#define RCC_AHB1LPENR_GPIOILPEN_POS     (0x08)
#define RCC_AHB1LPENR_GPIOILPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOILPEN_POS)
#define RCC_AHB1LPENR_GPIOJLPEN_POS     (0x09)
#define RCC_AHB1LPENR_GPIOJLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOJLPEN_POS)
#define RCC_AHB1LPENR_GPIOKLPEN_POS     (0x0A)
#define RCC_AHB1LPENR_GPIOKLPEN_MSK     (0x01 << RCC_AHB1LPENR_GPIOKLPEN_POS)
#define RCC_AHB1LPENR_CRCLPEN_POS       (0x00)
#define RCC_AHB1LPENR_CRCLPEN_MSK       (0x01 << RCC_AHB1LPENR_CRCLPEN_POS)
#define RCC_AHB1LPENR_FLITFLPEN_POS     (0x0C)
#define RCC_AHB1LPENR_FLITFLPEN_MSK     (0x01 << RCC_AHB1LPENR_FLITFLPEN_POS)
#define RCC_AHB1LPENR_SRAM1LPEN_POS     (0x0F)
#define RCC_AHB1LPENR_SRAM1LPEN_MSK     (0x01 << RCC_AHB1LPENR_SRAM1LPEN_POS)
#define RCC_AHB1LPENR_SRAM2LPEN_POS     (0x10)
#define RCC_AHB1LPENR_SRAM2LPEN_MSK     (0x01 << RCC_AHB1LPENR_SRAM2LPEN_POS)
#define RCC_AHB1LPENR_BKPSRAMLPEN_POS   (0x11)
#define RCC_AHB1LPENR_BKPSRAMLPEN_MSK   (0x01 << RCC_AHB1LPENR_BKPSRAMLPEN_POS)
#define RCC_AHB1LPENR_SRAM3LPEN_POS     (0x12)
#define RCC_AHB1LPENR_SRAM3LPEN_MSK     (0x01 << RCC_AHB1LPENR_SRAM3LPEN_POS)
#define RCC_AHB1LPENR_DMA1LPEN_POS      (0x14)
#define RCC_AHB1LPENR_DMA1LPEN_MSK      (0x01 << RCC_AHB1LPENR_DMA1LPEN_POS)
#define RCC_AHB1LPENR_DMA2LPEN_POS      (0x15)
#define RCC_AHB1LPENR_DMA2LPEN_MSK      (0x01 << RCC_AHB1LPENR_DMA2LPEN_POS)
#define RCC_AHB1LPENR_DMA2DLPEN_POS     (0x16)
#define RCC_AHB1LPENR_DMA2DLPEN_MSK     (0x01 << RCC_AHB1LPENR_DMA2DLPEN_POS)
#define RCC_AHB1LPENR_ETHMACLPEN_POS    (0x18)
#define RCC_AHB1LPENR_ETHMACLPEN_MSK    (0x01 << RCC_AHB1LPENR_ETHMACLPEN_POS)
#define RCC_AHB1LPENR_ETHMACTXLPEN_POS  (0x19)
#define RCC_AHB1LPENR_ETHMACTXLPEN_MSK  (0x01 << RCC_AHB1LPENR_ETHMACTXLPEN_POS)
#define RCC_AHB1LPENR_ETHMACRXLPEN_POS  (0x1A)
#define RCC_AHB1LPENR_ETHMACRXLPEN_MSK  (0x01 << RCC_AHB1LPENR_ETHMACRXLPEN_POS)
#define RCC_AHB1LPENR_ETHMACPTPLPEN_POS (0x1B)
#define RCC_AHB1LPENR_ETHMACPTPLPEN_MSK (0x01 << RCC_AHB1LPENR_ETHMACPTPLPEN_POS)
#define RCC_AHB1LPENR_OTGHSLPEN_POS     (0x1C)
#define RCC_AHB1LPENR_OTGHSLPEN_MSK     (0x01 << RCC_AHB1LPENR_OTGHSLPEN_POS)
#define RCC_AHB1LPENR_OTGHSULPILPEN_POS (0x1D)
#define RCC_AHB1LPENR_OTGHSULPILPEN_MSK (0x01 << RCC_AHB1LPENR_OTGHSULPILPEN_POS)

/* RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR) */
#define RCC_AHB2LPENR_DEFAULT (0x000000F1U)

#define RCC_AHB2LPENR_DCMILPEN_POS  (0x00)
#define RCC_AHB2LPENR_DCMILPEN_MSK  (0x01 << RCC_AHB2LPENR_DCMILPEN_POS)
#define RCC_AHB2LPENR_CRYPLPEN_POS  (0x04)
#define RCC_AHB2LPENR_CRYPLPEN_MSK  (0x01 << RCC_AHB2LPENR_CRYPLPEN_POS)
#define RCC_AHB2LPENR_HASHLPEN_POS  (0x05)
#define RCC_AHB2LPENR_HASHLPEN_MSK  (0x01 << RCC_AHB2LPENR_HASHLPEN_POS)
#define RCC_AHB2LPENR_RNGLPEN_POS   (0x06)
#define RCC_AHB2LPENR_RNGLPEN_MSK   (0x01 << RCC_AHB2LPENR_RNGLPEN_POS)
#define RCC_AHB2LPENR_OTGFSLPEN_POS (0x07)
#define RCC_AHB2LPENR_OTGFSLPEN_MSK (0x01 << RCC_AHB2LPENR_OTGFSLPEN_POS)

/* RCC AHB3 peripheral clock enable in low power mode register (RCC_AHB3LPENR) */
#define RCC_AHB3LPENR_DEFAULT (0x00000001U)

#define RCC_AHB2LPENR_FMCLPEN_POS  (0x00)
#define RCC_AHB2LPENR_FMCLPEN_MSK  (0x01 << RCC_AHB2LPENR_FMCLPEN_POS)

