komarovn654/stm32f4xx_hal/lib/rcc/inc/hal_rcc_regs.h
/* RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR) */
#define RCC_APB1LPENR_DEFAULT (0x36FEC9FFU)

#define RCC_APB1LPENR_TIM2LPEN_POS      (0x00)
#define RCC_APB1LPENR_TIM2LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM2LPEN_POS)
#define RCC_APB1LPENR_TIM3LPEN_POS      (0x01)
#define RCC_APB1LPENR_TIM3LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM3LPEN_POS)
#define RCC_APB1LPENR_TIM4LPEN_POS      (0x02)
#define RCC_APB1LPENR_TIM4LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM4LPEN_POS)
#define RCC_APB1LPENR_TIM5LPEN_POS      (0x03)
#define RCC_APB1LPENR_TIM5LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM5LPEN_POS)
#define RCC_APB1LPENR_TIM6LPEN_POS      (0x04)
#define RCC_APB1LPENR_TIM6LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM6LPEN_POS)
#define RCC_APB1LPENR_TIM7LPEN_POS      (0x05)
#define RCC_APB1LPENR_TIM7LPEN_MSK      (0x01 << RCC_APB1LPENR_TIM7LPEN_POS)
#define RCC_APB1LPENR_TIM12LPEN_POS     (0x06)
#define RCC_APB1LPENR_TIM12LPEN_MSK     (0x01 << RCC_APB1LPENR_TIM12LPEN_POS)
#define RCC_APB1LPENR_TIM13LPEN_POS     (0x07)
#define RCC_APB1LPENR_TIM13LPEN_MSK     (0x01 << RCC_APB1LPENR_TIM13LPEN_POS)
#define RCC_APB1LPENR_TIM14LPEN_POS     (0x08)
#define RCC_APB1LPENR_TIM14LPEN_MSK     (0x01 << RCC_APB1LPENR_TIM14LPEN_POS)
#define RCC_APB1LPENR_WWDGLPEN_POS      (0x0B)
#define RCC_APB1LPENR_WWDGLPEN_MSK      (0x01 << RCC_APB1LPENR_WWDGLPEN_POS)
#define RCC_APB1LPENR_SPI2LPEN_POS      (0x0E)
#define RCC_APB1LPENR_SPI2LPEN_MSK      (0x01 << RCC_APB1LPENR_SPI2LPEN_POS)
#define RCC_APB1LPENR_SPI3LPEN_POS      (0x0F)
#define RCC_APB1LPENR_SPI3LPEN_MSK      (0x01 << RCC_APB1LPENR_SPI3LPEN_POS)
#define RCC_APB1LPENR_USART2LPEN_POS    (0x11)
#define RCC_APB1LPENR_USART2LPEN_MSK    (0x01 << RCC_APB1LPENR_USART2LPEN_POS)
#define RCC_APB1LPENR_USART3LPEN_POS    (0x12)
#define RCC_APB1LPENR_USART3LPEN_MSK    (0x01 << RCC_APB1LPENR_USART3LPEN_POS)
#define RCC_APB1LPENR_UART4LPEN_POS     (0x13)
#define RCC_APB1LPENR_UART4LPEN_MSK     (0x01 << RCC_APB1LPENR_UART4LPEN_POS)
#define RCC_APB1LPENR_UART5LPEN_POS     (0x14)
#define RCC_APB1LPENR_UART5LPEN_MSK     (0x01 << RCC_APB1LPENR_UART5LPEN_POS)
#define RCC_APB1LPENR_I2C1LPEN_POS      (0x15)
#define RCC_APB1LPENR_I2C1LPEN_MSK      (0x01 << RCC_APB1LPENR_I2C1LPEN_POS)
#define RCC_APB1LPENR_I2C2LPEN_POS      (0x16)
#define RCC_APB1LPENR_I2C2LPEN_MSK      (0x01 << RCC_APB1LPENR_I2C2LPEN_POS)
#define RCC_APB1LPENR_I2C3LPEN_POS      (0x17)
#define RCC_APB1LPENR_I2C3LPEN_MSK      (0x01 << RCC_APB1LPENR_I2C3LPEN_POS)
#define RCC_APB1LPENR_CAN1LPEN_POS      (0x19)
#define RCC_APB1LPENR_CAN1LPEN_MSK      (0x01 << RCC_APB1LPENR_CAN1LPEN_POS)
#define RCC_APB1LPENR_CAN2LPEN_POS      (0x1A)
#define RCC_APB1LPENR_CAN2LPEN_MSK      (0x01 << RCC_APB1LPENR_CAN2LPEN_POS)
#define RCC_APB1LPENR_PWRLPEN_POS       (0x1C)
#define RCC_APB1LPENR_PWRLPEN_MSK       (0x01 << RCC_APB1LPENR_PWRLPEN_POS)
#define RCC_APB1LPENR_DACLPEN_POS       (0x1D)
#define RCC_APB1LPENR_DACLPEN_MSK       (0x01 << RCC_APB1LPENR_DACLPEN_POS)
#define RCC_APB1LPENR_UART7LPEN_POS     (0x1E)
#define RCC_APB1LPENR_UART7LPEN_MSK     (0x01 << RCC_APB1LPENR_UART7LPEN_POS)
#define RCC_APB1LPENR_UART8LPEN_POS     (0x1F)
#define RCC_APB1LPENR_UART8LPEN_MSK     (0x01 << RCC_APB1LPENR_UART8LPEN_POS)

/* RCC APB2 peripheral clock enabled in low power mode register (RCC_APB2LPENR) */
#define RCC_APB2LPENR_DEFAULT (0x00075F33U)

#define RCC_APB2LPENR_TIM1LPEN_POS      (0x00)
#define RCC_APB2LPENR_TIM1LPEN_MSK      (0x01 << RCC_APB2LPENR_TIM1LPEN_POS)
#define RCC_APB2LPENR_TIM8LPEN_POS      (0x01)
#define RCC_APB2LPENR_TIM8LPEN_MSK      (0x01 << RCC_APB2LPENR_TIM8LPEN_POS)
#define RCC_APB2LPENR_USART1LPEN_POS    (0x04)
#define RCC_APB2LPENR_USART1LPEN_MSK    (0x01 << RCC_APB2LPENR_USART1LPEN_POS)
#define RCC_APB2LPENR_USART6LPEN_POS    (0x05)
#define RCC_APB2LPENR_USART6LPEN_MSK    (0x01 << RCC_APB2LPENR_USART6LPEN_POS)
#define RCC_APB2LPENR_ADC1LPEN_POS      (0x08)
#define RCC_APB2LPENR_ADC1LPEN_MSK      (0x01 << RCC_APB2LPENR_ADC1LPEN_POS)
#define RCC_APB2LPENR_ADC2LPEN_POS      (0x09)
#define RCC_APB2LPENR_ADC2LPEN_MSK      (0x01 << RCC_APB2LPENR_ADC2LPEN_POS)
#define RCC_APB2LPENR_ADC3LPEN_POS      (0x0A)
#define RCC_APB2LPENR_ADC3LPEN_MSK      (0x01 << RCC_APB2LPENR_ADC3LPEN_POS)
#define RCC_APB2LPENR_SDIOLPEN_POS      (0x0B)
#define RCC_APB2LPENR_SDIOLPEN_MSK      (0x01 << RCC_APB2LPENR_SDIOLPEN_POS)
#define RCC_APB2LPENR_SPI1LPEN_POS      (0x0C)
#define RCC_APB2LPENR_SPI1LPEN_MSK      (0x01 << RCC_APB2LPENR_SPI1LPEN_POS)
#define RCC_APB2LPENR_SPI4LPEN_POS      (0x0D)
#define RCC_APB2LPENR_SPI4LPEN_MSK      (0x01 << RCC_APB2LPENR_SPI4LPEN_POS)
#define RCC_APB2LPENR_SYSCFGLPEN_POS    (0x0E)
#define RCC_APB2LPENR_SYSCFGLPEN_MSK    (0x01 << RCC_APB2LPENR_SYSCFGLPEN_POS)
#define RCC_APB2LPENR_TIM9LPEN_POS      (0x10)
#define RCC_APB2LPENR_TIM9LPEN_MSK      (0x01 << RCC_APB2LPENR_TIM9LPEN_POS)
#define RCC_APB2LPENR_TIM10LPEN_POS     (0x11)
#define RCC_APB2LPENR_TIM10LPEN_MSK     (0x01 << RCC_APB2LPENR_TIM10LPEN_POS)
#define RCC_APB2LPENR_TIM11LPEN_POS     (0x12)
#define RCC_APB2LPENR_TIM11LPEN_MSK     (0x01 << RCC_APB2LPENR_TIM11LPEN_POS)
#define RCC_APB2LPENR_SPI5LPEN_POS      (0x14)
#define RCC_APB2LPENR_SPI5LPEN_MSK      (0x01 << RCC_APB2LPENR_SPI5LPEN_POS)
#define RCC_APB2LPENR_SPI6LPEN_POS      (0x15)
#define RCC_APB2LPENR_SPI6LPEN_MSK      (0x01 << RCC_APB2LPENR_SPI6LPEN_POS)
#define RCC_APB2LPENR_SAI1LPEN_POS      (0x16)
#define RCC_APB2LPENR_SAI1LPEN_MSK      (0x01 << RCC_APB2LPENR_SAI1LPEN_POS)
#define RCC_APB2LPENR_LTDCLPEN_POS      (0x1A)
#define RCC_APB2LPENR_LTDCLPEN_MSK      (0x01 << RCC_APB2LPENR_LTDCLPEN_POS)

/* RCC Backup domain control register (RCC_BDCR) */
#define RCC_BDCR_DEFAULT (0x00000000U)

#define RCC_BDCR_LSEON_POS  (0x00)
#define RCC_BDCR_LSEON_MSK  (0x01 << RCC_BDCR_LSEON_POS)
#define RCC_BDCR_LSERDY_POS (0x01)
#define RCC_BDCR_LSERDY_MSK (0x01 << RCC_BDCR_LSERDY_POS)
#define RCC_BDCR_LSEBYP_POS (0x02)
#define RCC_BDCR_LSEBYP_MSK (0x01 << RCC_BDCR_LSEBYP_POS)
#define RCC_BDCR_RTCSEL_POS (0x08)
#define RCC_BDCR_RTCSEL_MSK (0x03 << RCC_BDCR_RTCSEL_POS)
#define RCC_BDCR_RTCEN_POS  (0x0F)
#define RCC_BDCR_RTCEN_MSK  (0x01 << RCC_BDCR_RTCEN_POS)
#define RCC_BDCR_BDRST_POS  (0x10)
#define RCC_BDCR_BDRST_MSK  (0x01 << RCC_BDCR_BDRST_POS)

/* RCC clock control & status register (RCC_CSR) */
#define RCC_CSR_DEFAULT (0x0E000000U)

#define RCC_CSR_LSION_POS       (0x00)
#define RCC_CSR_LSION_MSK       (0x01 << RCC_CSR_LSION_POS)
#define RCC_CSR_LSIRDY_POS      (0x01)
#define RCC_CSR_LSIRDY_MSK      (0x01 << RCC_CSR_LSIRDY_POS)
#define RCC_CSR_RMVF_POS        (0x18)
#define RCC_CSR_RMVF_MSK        (0x01 << RCC_CSR_RMVF_POS)
#define RCC_CSR_BORRSTF_POS     (0x19)
#define RCC_CSR_BORRSTF_MSK     (0x01 << RCC_CSR_BORRSTF_POS)
#define RCC_CSR_PINRSTF_POS     (0x1A)
#define RCC_CSR_PINRSTF_MSK     (0x01 << RCC_CSR_PINRSTF_POS)
#define RCC_CSR_PORRSTF_POS     (0x1B)
#define RCC_CSR_PORRSTF_MSK     (0x01 << RCC_CSR_PORRSTF_POS)
#define RCC_CSR_SFTRSTF_POS     (0x1C)
#define RCC_CSR_SFTRSTF_MSK     (0x01 << RCC_CSR_SFTRSTF_POS)
#define RCC_CSR_IWDGRSTF_POS    (0x1D)
#define RCC_CSR_IWDGRSTF_MSK    (0x01 << RCC_CSR_IWDGRSTF_POS)
#define RCC_CSR_WWDGRSTF_POS    (0x1E)
#define RCC_CSR_WWDGRSTF_MSK    (0x01 << RCC_CSR_WWDGRSTF_POS)
#define RCC_CSR_LPWRRSTF_POS    (0x1F)
#define RCC_CSR_LPWRRSTF_MSK    (0x01 << RCC_CSR_LPWRRSTF_POS)

/* RCC spread spectrum clock generation register (RCC_SSCGR) */
#define RCC_SSCGR_DEFAULT (0x00000000U)

#define RCC_SSCGR_MODPER_POS    (0x00)
#define RCC_SSCGR_MODPER_MSK    (0x1FFF << RCC_SSCGR_MODPER_POS)
#define RCC_SSCGR_INCSTEP_POS   (0x0D)
#define RCC_SSCGR_INCSTEP_MSK   (0x7FFF << RCC_SSCGR_INCSTEP_POS)
#define RCC_SSCGR_SPREADSEL_POS (0x1E)
#define RCC_SSCGR_SPREADSEL_MSK (0x01 << RCC_SSCGR_SPREADSEL_POS)
#define RCC_SSCGR_SSCGEN_POS    (0x1F)

/* RCC PLLI2S configuration register (RCC_PLLI2SCFGR) */
#define RCC_PLLI2SCFGR_DEFAULT (0x04003000U)

