komarovn654/stm32f4xx_hal/lib/rcc/inc/hal_rcc_regs.h
#define RCC_PLLI2SCFGR_PLLI2SN_POS  (0x06)
#define RCC_PLLI2SCFGR_PLLI2SN_MSK  (0x1FF << RCC_PLLI2SCFGR_PLLI2SN_POS)
#define RCC_PLLI2SCFGR_PLLI2SQ_POS  (0x18)
#define RCC_PLLI2SCFGR_PLLI2SQ_MSK  (0x0F << RCC_PLLI2SCFGR_PLLI2SQ_POS)
#define RCC_PLLI2SCFGR_PLLI2SR_POS  (0x1C)
#define RCC_PLLI2SCFGR_PLLI2SR_MSK  (0x07 << RCC_PLLI2SCFGR_PLLI2SR_POS)

/* RCC PLL configuration register (RCC_PLLSAICFGR) */
#define RCC_PLLSAICFGR_DEFAULT (0x20003000U)

#define RCC_PLLSAICFGR_PLLSAIN_POS  (0x06)
#define RCC_PLLSAICFGR_PLLSAIN_MSK  (0x1FF << RCC_PLLSAICFGR_PLLSAIN_POS)
#define RCC_PLLSAICFGR_PLLSAIQ_POS  (0x18)
#define RCC_PLLSAICFGR_PLLSAIQ_MSK  (0x0F << RCC_PLLSAICFGR_PLLSAIQ_POS)
#define RCC_PLLSAICFGR_PLLSAIR_POS  (0x1C)
#define RCC_PLLSAICFGR_PLLSAIR_MSK  (0x07 << RCC_PLLSAICFGR_PLLSAIR_POS)

/* RCC Dedicated Clock Configuration Register (RCC_DCKCFGR) */
#define RCC_DCKCFGR_DEFAULT (0x00000000U)

#define RCC_DCKCFGR_PLLI2SDIVQ_POS (0x00)
#define RCC_DCKCFGR_PLLI2SDIVQ_MSK (0x1F << RCC_DCKCFGR_PLLI2SDIVQ_POS)
#define RCC_DCKCFGR_PLLSAIDIVQ_POS (0x08)
#define RCC_DCKCFGR_PLLSAIDIVQ_MSK (0x1F << RCC_DCKCFGR_PLLSAIDIVQ_POS)
#define RCC_DCKCFGR_PLLSAIDIVR_POS (0x10)
#define RCC_DCKCFGR_PLLSAIDIVR_MSK (0x03 << RCC_DCKCFGR_PLLSAIDIVR_POS)
#define RCC_DCKCFGR_SAI1ASRC_POS   (0x14)
#define RCC_DCKCFGR_SAI1ASRC_MSK   (0x03 << RCC_DCKCFGR_SAI1ASRC_POS)
#define RCC_DCKCFGR_SAI1BSRC_POS   (0x16)
#define RCC_DCKCFGR_SAI1BSRC_MSK   (0x03 << RCC_DCKCFGR_SAI1BSRC_POS)
#define RCC_DCKCFGR_TIMPRE_POS     (0x18)
#define RCC_DCKCFGR_TIMPRE_MSK     (0x01 << RCC_DCKCFGR_TIMPRE_POS)